   <div class="row">
        <div class="col-lg-9">
            <h1>1070.Product Sales Analysis III</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>Table:&nbsp;<code>Sales3</code></p>

<pre>
+-------------+-------+
| Column Name | Type  |
+-------------+-------+
| sale_id     | int   |
| product_id  | int   |
| year        | int   |
| quantity    | int   |
| price       | int   |
+-------------+-------+
sale_id is the primary key of this table.
product_id is a foreign key to <code>Product3</code> table.
Note that the price is per unit.
</pre>

<p>Table:&nbsp;<code>Product3</code></p>

<pre>
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| product_id   | int     |
| product_name | varchar |
+--------------+---------+
product_id is the primary key of this table.
</pre>

<p>&nbsp;</p>

<p style="direction: ltr;">Write an SQL query that selects the <strong>product id</strong>, <strong>year</strong>, <strong>quantity</strong>, and <strong>price</strong> for the <strong>first year</strong> of every product sold.</p>

<p>The query result format is in the following example:</p>

<pre>
<code>Sales3</code> table:
+---------+------------+------+----------+-------+
| sale_id | product_id | year | quantity | price |
+---------+------------+------+----------+-------+ 
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |
+---------+------------+------+----------+-------+

Product3 table:
+------------+--------------+
| product_id | product_name |
+------------+--------------+
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |
+------------+--------------+

Result table:
+------------+------------+----------+-------+
| product_id | first_year | quantity | price |
+------------+------------+----------+-------+ 
| 100        | 2008       | 10       | 5000  |
| 200        | 2011       | 15       | 9000  |
+------------+------------+----------+-------+
</pre>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("Product3", engine)

   product_id product_name
0         100        Nokia
1         200        Apple
2         300      Samsung

In [3]:
pd.read_sql_table("Sales3", engine)

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [4]:
query = '''
SELECT product_id, year first_year, quantity, price
FROM Sales3
WHERE (product_id, year) IN (SELECT product_id, min(year)
                              FROM Sales3
                              GROUP BY product_id);
'''
pd.read_sql_query(query, engine)

   product_id  first_year  quantity  price
0         100        2008        10   5000
1         200        2011        15   9000

## Note:
# Time: O(n)
# Space: O(n)

#### 1. Subquery.
#### 2. select a, sum(b) from xxx GROUP BY a [could not show other variables in mysql]